---
title: Speckle
classe: Autodesk.Revit.DB.Visual.Speckle
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# Speckle

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String SpeckleColor1 { get; }` | `Speckle.SpeckleColor1` | String |
| `String SpeckleColor2 { get; }` | `Speckle.SpeckleColor2` | String |
| `String SpeckleSize { get; }` | `Speckle.SpeckleSize` | String |
| `String TextureAngle { get; }` | `Speckle.TextureAngle` | String |
| `String TextureLinkTextureTransforms { get; }` | `Speckle.TextureLinkTextureTransforms` | String |
| `String TextureRealWorldOffsetX { get; }` | `Speckle.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Speckle.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldOffsetZ { get; }` | `Speckle.TextureRealWorldOffsetZ` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```